"""
堅持表白100天，每天都送10朵花
"""
# i = 0
# # 最後是不是要用臨時變量?所以要先定義一個變量
# for i in range(1,101):
#     print(f"今天是向小美表白的第{i}天")
#
#     # 內層循環
#     for j in range(1,11):
#         print(f"給小美送的第{j}朵玫瑰花")
#
#     print("小美我喜歡你")
# print(f"第{i}天表白成功")

# !!!注意點，你可以while 跟 for 循環並用
a = 0
b = 0
for a in range(1,10):
    for b in range(1,a + 1):
        # 為什麼是a+1呢?因為要控制行數，當a是第幾行時，b才會乘的哪邊去
        # 而+1是因為，如果當a是5，那for只會跑到4，所以要+1
        print(f"{b}*{a}={b*a}\t",end='')
    print()
    # 通過print就可以換行

"""
自己做錯的
a = 0
b = 0
for a in range(1,10):
    for b in range(1,10):
    !!!這邊錯誤，由於b控制每一行的內容，所以要給它限制到哪一行就給多少個
    所以才寫 a + 1 !!!
        print(f"{a}*{b}={a*b}\t",end='')
    !!!這邊也是應該由內容去乘行數，不然就會變成
                                1*1 
                                2*1
                                3*1
    print()
    # 通過print就可以換行
"""