# 設定一個條件，只要條線滿足，無限循環直到條件不滿足、或是自己設定的停止點
# 條件就是布爾類型或是比較運算
# 跟if一樣要加冒號
i = 0
while i<5:
    print("小美我喜歡你")
    i+=1
# 小練習:求1-100的合
sum = 0
num = 1
while num<=100:
    sum+=num
    num+=1
print(sum)

# 這邊需要注意的邏輯是
"""
num = 1
在這個循環中他會從1開始+1，重複在while裡面
sum = 0則是代表第一次num+1=2,第二次num+1 = 3
sum在這個迴圈裡面只儲存num += n
拆開來看就是
while num <=100:
sum(0) +=num(1)
num(1) +=1 or num(1) = num(1) + 1 等於2
下一次循環就是
sum(0) +完 num(1) = sum(1)
num(1) +完 1 = num(2)
所以
sum(1) += num(2)
num(2) +=1 num(3)

數字細分就是
sum = 0 + 1 = 1(總共)
num = 1 + 1 = 2(次數)
sum = 1 + 2 = 3(總共)
num = 2 + 1 = 3(次數)
"""